---
title: GroupTypeId
classe: Autodesk.Revit.DB.GroupTypeId
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 124
---

# GroupTypeId

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ForgeTypeId AdskModelProperties { get; }` | `GroupTypeId.AdskModelProperties` | ForgeTypeId |
| `ForgeTypeId AlternateUnits { get; }` | `GroupTypeId.AlternateUnits` | ForgeTypeId |
| `ForgeTypeId AnalysisResults { get; }` | `GroupTypeId.AnalysisResults` | ForgeTypeId |
| `ForgeTypeId AnalyticalAlignment { get; }` | `GroupTypeId.AnalyticalAlignment` | ForgeTypeId |
| `ForgeTypeId AnalyticalModel { get; }` | `GroupTypeId.AnalyticalModel` | ForgeTypeId |
| `ForgeTypeId AnalyticalProperties { get; }` | `GroupTypeId.AnalyticalProperties` | ForgeTypeId |
| `ForgeTypeId Area { get; }` | `GroupTypeId.Area` | ForgeTypeId |
| `ForgeTypeId ConceptualEnergyData { get; }` | `GroupTypeId.ConceptualEnergyData` | ForgeTypeId |
| `ForgeTypeId ConceptualEnergyDataBuildingServices { get; }` | `GroupTypeId.ConceptualEnergyDataBuildingServices` | ForgeTypeId |
| `ForgeTypeId Constraints { get; }` | `GroupTypeId.Constraints` | ForgeTypeId |
| `ForgeTypeId Construction { get; }` | `GroupTypeId.Construction` | ForgeTypeId |
| `ForgeTypeId ContinuousrailBeginBottomExtension { get; }` | `GroupTypeId.ContinuousrailBeginBottomExtension` | ForgeTypeId |
| `ForgeTypeId ContinuousrailEndTopExtension { get; }` | `GroupTypeId.ContinuousrailEndTopExtension` | ForgeTypeId |
| `ForgeTypeId CouplerArray { get; }` | `GroupTypeId.CouplerArray` | ForgeTypeId |
| `ForgeTypeId CurtainGrid { get; }` | `GroupTypeId.CurtainGrid` | ForgeTypeId |
| `ForgeTypeId CurtainGridHoriz { get; }` | `GroupTypeId.CurtainGridHoriz` | ForgeTypeId |
| `ForgeTypeId CurtainGridn1 { get; }` | `GroupTypeId.CurtainGridn1` | ForgeTypeId |
| `ForgeTypeId CurtainGridn2 { get; }` | `GroupTypeId.CurtainGridn2` | ForgeTypeId |
| `ForgeTypeId CurtainGridU { get; }` | `GroupTypeId.CurtainGridU` | ForgeTypeId |
| `ForgeTypeId CurtainGridV { get; }` | `GroupTypeId.CurtainGridV` | ForgeTypeId |
| `ForgeTypeId CurtainGridVert { get; }` | `GroupTypeId.CurtainGridVert` | ForgeTypeId |
| `ForgeTypeId CurtainMullionHoriz { get; }` | `GroupTypeId.CurtainMullionHoriz` | ForgeTypeId |
| `ForgeTypeId CurtainMullionn1 { get; }` | `GroupTypeId.CurtainMullionn1` | ForgeTypeId |
| `ForgeTypeId CurtainMullionn2 { get; }` | `GroupTypeId.CurtainMullionn2` | ForgeTypeId |
| `ForgeTypeId CurtainMullionVert { get; }` | `GroupTypeId.CurtainMullionVert` | ForgeTypeId |
| `ForgeTypeId Data { get; }` | `GroupTypeId.Data` | ForgeTypeId |
| `ForgeTypeId Display { get; }` | `GroupTypeId.Display` | ForgeTypeId |
| `ForgeTypeId DivisionGeometry { get; }` | `GroupTypeId.DivisionGeometry` | ForgeTypeId |
| `ForgeTypeId Electrical { get; }` | `GroupTypeId.Electrical` | ForgeTypeId |
| `ForgeTypeId ElectricalAnalysis { get; }` | `GroupTypeId.ElectricalAnalysis` | ForgeTypeId |
| `ForgeTypeId ElectricalCircuiting { get; }` | `GroupTypeId.ElectricalCircuiting` | ForgeTypeId |
| `ForgeTypeId ElectricalEngineering { get; }` | `GroupTypeId.ElectricalEngineering` | ForgeTypeId |
| `ForgeTypeId ElectricalLighting { get; }` | `GroupTypeId.ElectricalLighting` | ForgeTypeId |
| `ForgeTypeId ElectricalLoads { get; }` | `GroupTypeId.ElectricalLoads` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysis { get; }` | `GroupTypeId.EnergyAnalysis` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisAdvanced { get; }` | `GroupTypeId.EnergyAnalysisAdvanced` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisBldgConsMtlThermalProps { get; }` | `GroupTypeId.EnergyAnalysisBldgConsMtlThermalProps` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisBuildingData { get; }` | `GroupTypeId.EnergyAnalysisBuildingData` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisConceptualModel { get; }` | `GroupTypeId.EnergyAnalysisConceptualModel` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisDetailedAndConceptualModels { get; }` | `GroupTypeId.EnergyAnalysisDetailedAndConceptualModels` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisDetailedModel { get; }` | `GroupTypeId.EnergyAnalysisDetailedModel` | ForgeTypeId |
| `ForgeTypeId EnergyAnalysisRoomSpaceData { get; }` | `GroupTypeId.EnergyAnalysisRoomSpaceData` | ForgeTypeId |
| `ForgeTypeId FabricationProductData { get; }` | `GroupTypeId.FabricationProductData` | ForgeTypeId |
| `ForgeTypeId FireProtection { get; }` | `GroupTypeId.FireProtection` | ForgeTypeId |
| `ForgeTypeId Fitting { get; }` | `GroupTypeId.Fitting` | ForgeTypeId |
| `ForgeTypeId Flexible { get; }` | `GroupTypeId.Flexible` | ForgeTypeId |
| `ForgeTypeId Forces { get; }` | `GroupTypeId.Forces` | ForgeTypeId |
| `ForgeTypeId General { get; }` | `GroupTypeId.General` | ForgeTypeId |
| `ForgeTypeId GeoLocation { get; }` | `GroupTypeId.GeoLocation` | ForgeTypeId |
| `ForgeTypeId Geometry { get; }` | `GroupTypeId.Geometry` | ForgeTypeId |
| `ForgeTypeId GeometryPositioning { get; }` | `GroupTypeId.GeometryPositioning` | ForgeTypeId |
| `ForgeTypeId Graphics { get; }` | `GroupTypeId.Graphics` | ForgeTypeId |
| `ForgeTypeId GreenBuilding { get; }` | `GroupTypeId.GreenBuilding` | ForgeTypeId |
| `ForgeTypeId IdentityData { get; }` | `GroupTypeId.IdentityData` | ForgeTypeId |
| `ForgeTypeId Ifc { get; }` | `GroupTypeId.Ifc` | ForgeTypeId |
| `ForgeTypeId Insulation { get; }` | `GroupTypeId.Insulation` | ForgeTypeId |
| `ForgeTypeId Length { get; }` | `GroupTypeId.Length` | ForgeTypeId |
| `ForgeTypeId LifeSafety { get; }` | `GroupTypeId.LifeSafety` | ForgeTypeId |
| `ForgeTypeId LightPhotometrics { get; }` | `GroupTypeId.LightPhotometrics` | ForgeTypeId |
| `ForgeTypeId Lining { get; }` | `GroupTypeId.Lining` | ForgeTypeId |
| `ForgeTypeId Materials { get; }` | `GroupTypeId.Materials` | ForgeTypeId |
| `ForgeTypeId Mechanical { get; }` | `GroupTypeId.Mechanical` | ForgeTypeId |
| `ForgeTypeId MechanicalAirflow { get; }` | `GroupTypeId.MechanicalAirflow` | ForgeTypeId |
| `ForgeTypeId MechanicalLoads { get; }` | `GroupTypeId.MechanicalLoads` | ForgeTypeId |
| `ForgeTypeId Moments { get; }` | `GroupTypeId.Moments` | ForgeTypeId |
| `ForgeTypeId Nodes { get; }` | `GroupTypeId.Nodes` | ForgeTypeId |
| `ForgeTypeId OverallLegend { get; }` | `GroupTypeId.OverallLegend` | ForgeTypeId |
| `ForgeTypeId Pattern { get; }` | `GroupTypeId.Pattern` | ForgeTypeId |
| `ForgeTypeId PatternApplication { get; }` | `GroupTypeId.PatternApplication` | ForgeTypeId |
| `ForgeTypeId Phasing { get; }` | `GroupTypeId.Phasing` | ForgeTypeId |
| `ForgeTypeId Plumbing { get; }` | `GroupTypeId.Plumbing` | ForgeTypeId |
| `ForgeTypeId PrimaryEnd { get; }` | `GroupTypeId.PrimaryEnd` | ForgeTypeId |
| `ForgeTypeId PrimaryUnits { get; }` | `GroupTypeId.PrimaryUnits` | ForgeTypeId |
| `ForgeTypeId Profile { get; }` | `GroupTypeId.Profile` | ForgeTypeId |
| `ForgeTypeId Profilen1 { get; }` | `GroupTypeId.Profilen1` | ForgeTypeId |
| `ForgeTypeId Profilen2 { get; }` | `GroupTypeId.Profilen2` | ForgeTypeId |
| `ForgeTypeId RailingSystemFamilyHandrails { get; }` | `GroupTypeId.RailingSystemFamilyHandrails` | ForgeTypeId |
| `ForgeTypeId RailingSystemFamilySegmentPattern { get; }` | `GroupTypeId.RailingSystemFamilySegmentPattern` | ForgeTypeId |
| `ForgeTypeId RailingSystemFamilyTopRail { get; }` | `GroupTypeId.RailingSystemFamilyTopRail` | ForgeTypeId |
| `ForgeTypeId RailingSystemSecondaryFamilyHandrails { get; }` | `GroupTypeId.RailingSystemSecondaryFamilyHandrails` | ForgeTypeId |
| `ForgeTypeId RailingSystemSegmentPatternRemainder { get; }` | `GroupTypeId.RailingSystemSegmentPatternRemainder` | ForgeTypeId |
| `ForgeTypeId RailingSystemSegmentPatternRepeat { get; }` | `GroupTypeId.RailingSystemSegmentPatternRepeat` | ForgeTypeId |
| `ForgeTypeId RailingSystemSegmentPosts { get; }` | `GroupTypeId.RailingSystemSegmentPosts` | ForgeTypeId |
| `ForgeTypeId RailingSystemSegmentUGrid { get; }` | `GroupTypeId.RailingSystemSegmentUGrid` | ForgeTypeId |
| `ForgeTypeId RailingSystemSegmentVGrid { get; }` | `GroupTypeId.RailingSystemSegmentVGrid` | ForgeTypeId |
| `ForgeTypeId RebarArray { get; }` | `GroupTypeId.RebarArray` | ForgeTypeId |
| `ForgeTypeId RebarSystemLayers { get; }` | `GroupTypeId.RebarSystemLayers` | ForgeTypeId |
| `ForgeTypeId Reference { get; }` | `GroupTypeId.Reference` | ForgeTypeId |
| `ForgeTypeId ReleasesMemberForces { get; }` | `GroupTypeId.ReleasesMemberForces` | ForgeTypeId |
| `ForgeTypeId RotationAbout { get; }` | `GroupTypeId.RotationAbout` | ForgeTypeId |
| `ForgeTypeId RouteAnalysis { get; }` | `GroupTypeId.RouteAnalysis` | ForgeTypeId |
| `ForgeTypeId SecondaryEnd { get; }` | `GroupTypeId.SecondaryEnd` | ForgeTypeId |
| `ForgeTypeId SegmentsFittings { get; }` | `GroupTypeId.SegmentsFittings` | ForgeTypeId |
| `ForgeTypeId SlabShapeEdit { get; }` | `GroupTypeId.SlabShapeEdit` | ForgeTypeId |
| `ForgeTypeId SplitProfileDimensions { get; }` | `GroupTypeId.SplitProfileDimensions` | ForgeTypeId |
| `ForgeTypeId StairRisers { get; }` | `GroupTypeId.StairRisers` | ForgeTypeId |
| `ForgeTypeId StairsCalculatorRules { get; }` | `GroupTypeId.StairsCalculatorRules` | ForgeTypeId |
| `ForgeTypeId StairsOpenEndConnection { get; }` | `GroupTypeId.StairsOpenEndConnection` | ForgeTypeId |
| `ForgeTypeId StairsSupports { get; }` | `GroupTypeId.StairsSupports` | ForgeTypeId |
| `ForgeTypeId StairsTreadsRisers { get; }` | `GroupTypeId.StairsTreadsRisers` | ForgeTypeId |
| `ForgeTypeId StairStringers { get; }` | `GroupTypeId.StairStringers` | ForgeTypeId |
| `ForgeTypeId StairsWinders { get; }` | `GroupTypeId.StairsWinders` | ForgeTypeId |
| `ForgeTypeId StairTreads { get; }` | `GroupTypeId.StairTreads` | ForgeTypeId |
| `ForgeTypeId Structural { get; }` | `GroupTypeId.Structural` | ForgeTypeId |
| `ForgeTypeId StructuralAnalysis { get; }` | `GroupTypeId.StructuralAnalysis` | ForgeTypeId |
| `ForgeTypeId StructuralSectionDimensions { get; }` | `GroupTypeId.StructuralSectionDimensions` | ForgeTypeId |
| `ForgeTypeId StructuralSectionGeometry { get; }` | `GroupTypeId.StructuralSectionGeometry` | ForgeTypeId |
| `ForgeTypeId Support { get; }` | `GroupTypeId.Support` | ForgeTypeId |
| `ForgeTypeId SystemtypeRisedrop { get; }` | `GroupTypeId.SystemtypeRisedrop` | ForgeTypeId |
| `ForgeTypeId Termination { get; }` | `GroupTypeId.Termination` | ForgeTypeId |
| `ForgeTypeId Text { get; }` | `GroupTypeId.Text` | ForgeTypeId |
| `ForgeTypeId Title { get; }` | `GroupTypeId.Title` | ForgeTypeId |
| `ForgeTypeId ToposolidSubdivision { get; }` | `GroupTypeId.ToposolidSubdivision` | ForgeTypeId |
| `ForgeTypeId TranslationIn { get; }` | `GroupTypeId.TranslationIn` | ForgeTypeId |
| `ForgeTypeId TrussFamilyBottomChord { get; }` | `GroupTypeId.TrussFamilyBottomChord` | ForgeTypeId |
| `ForgeTypeId TrussFamilyDiagWeb { get; }` | `GroupTypeId.TrussFamilyDiagWeb` | ForgeTypeId |
| `ForgeTypeId TrussFamilyTopChord { get; }` | `GroupTypeId.TrussFamilyTopChord` | ForgeTypeId |
| `ForgeTypeId TrussFamilyVertWeb { get; }` | `GroupTypeId.TrussFamilyVertWeb` | ForgeTypeId |
| `ForgeTypeId Underlay { get; }` | `GroupTypeId.Underlay` | ForgeTypeId |
| `ForgeTypeId ViewCamera { get; }` | `GroupTypeId.ViewCamera` | ForgeTypeId |
| `ForgeTypeId ViewExtents { get; }` | `GroupTypeId.ViewExtents` | ForgeTypeId |
| `ForgeTypeId Visibility { get; }` | `GroupTypeId.Visibility` | ForgeTypeId |
| `ForgeTypeId Visualization { get; }` | `GroupTypeId.Visualization` | ForgeTypeId |
| `ForgeTypeId WallCrossSectionDefinition { get; }` | `GroupTypeId.WallCrossSectionDefinition` | ForgeTypeId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```